package lessons.lesson_10;

public class Note {
    /*
    1. Создать класс Заметка
    2. Переменные номер, текст заметки, день недели
    3. Конструктор, тустринг
    4. Менеджер заметок в новом классе
    5. Метод для создания новой заметки, где будем все вводить через сканнер
    6. В новом классе Демо запускаем мейн и создаем экземпляры заметок
     */

    /*
    Вариант 2:
    1. Реализовать программу с помощью иф, Свитч и кейс
    2. Создается сканнер
    3. Выберите день недели 1-7
     */
}
